import React from "react";
import Carousel from "react-multi-carousel";
import "react-multi-carousel/lib/styles.css";
import styles from "./ServiceSection.module.scss";

const responsive = {
  desktop: {
    breakpoint: { max: 3000, min: 1024 },
    items: 3,
  },
  tablet: {
    breakpoint: { max: 1024, min: 464 },
    items: 1,
  },
  mobile: {
    breakpoint: { max: 464, min: 0 },
    items: 1,
  },
};

const ServiceSection = () => {
  return (
    <div className={styles.ServiceSection}>
      <div className={styles.titleNWatchMore}>
        <h3>Ծառայություններ</h3>
        <button className={styles.watchMore}>Տեսնել ավելին</button>
      </div>
      <div className={styles.serviceSlider}>
        <Carousel
          className={styles.carousel}
          responsive={responsive}
          autoPlay={true}
          swipeable={true}
          draggable={true}
          showDots={false}
          infinite={true}
          autoPlaySpeed={3000}
          partialVisible={false}
          dotListClass="custom-dot-list-style"
        >
          <div className={styles.serviceCard}>
            <div className={styles.icon}>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="26"
                height="26"
                viewBox="0 0 26 26"
                fill="none"
              >
                <path
                  d="M18.332 1.77203H0V19.607L4.124 15.483H18.332V1.77203ZM4.57031 4.81891H13.7617V6.34235H4.57031V4.81891ZM13.7617 12.4361H4.57031V10.9127H13.7617V12.4361ZM15.2852 9.38922H3.04688V7.86578H15.2852V9.38922Z"
                  fill="#3E4095"
                />
                <path
                  d="M19.8555 17.0064H7.61719V20.0533H21.8252L26 24.228V6.34235H19.8555V17.0064Z"
                  fill="#3E4095"
                />
              </svg>
            </div>
            <h4>Խորհրդատվություն</h4>
            <p>
              Անհրաժեշտ սարքավորման ճիշտ ընտրության համար առաջարկում ենք
              խորհրդակցել մեր մասնագետների հետ:
            </p>
            <a href="#">
              <span>Կարդալ ավելին</span>
              <span>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="24"
                  height="14"
                  viewBox="0 0 24 14"
                  fill="none"
                >
                  <path
                    d="M0 7.00002C0 7.26523 0.105357 7.51959 0.292893 7.70712C0.48043 7.89466 0.734784 8.00002 1 8.00002H20.586L16.294 12.292C16.1118 12.4806 16.011 12.7332 16.0133 12.9954C16.0156 13.2576 16.1208 13.5084 16.3062 13.6938C16.4916 13.8792 16.7424 13.9844 17.0046 13.9867C17.2668 13.989 17.5194 13.8882 17.708 13.706L23.708 7.70602C23.8005 7.61402 23.874 7.50464 23.9241 7.38417C23.9742 7.26369 24 7.1345 24 7.00402V7.00002C24 6.87002 23.974 6.74002 23.922 6.61802C23.8722 6.49678 23.7987 6.38665 23.706 6.29402L17.706 0.294017C17.5174 0.111859 17.2648 0.011065 17.0026 0.0133435C16.7404 0.0156219 16.4896 0.120791 16.3042 0.306199C16.1188 0.491607 16.0136 0.74242 16.0113 1.00462C16.009 1.26681 16.1098 1.51942 16.292 1.70802L20.586 6.00002H1C0.734784 6.00002 0.48043 6.10537 0.292893 6.29291C0.105357 6.48045 0 6.7348 0 7.00002Z"
                    fill="#3E4095"
                  />
                </svg>
              </span>
            </a>
          </div>
          <div className={styles.serviceCard}>
            <div className={styles.icon}>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="26"
                height="26"
                viewBox="0 0 26 26"
                fill="none"
              >
                <path
                  d="M18.332 1.77203H0V19.607L4.124 15.483H18.332V1.77203ZM4.57031 4.81891H13.7617V6.34235H4.57031V4.81891ZM13.7617 12.4361H4.57031V10.9127H13.7617V12.4361ZM15.2852 9.38922H3.04688V7.86578H15.2852V9.38922Z"
                  fill="#3E4095"
                />
                <path
                  d="M19.8555 17.0064H7.61719V20.0533H21.8252L26 24.228V6.34235H19.8555V17.0064Z"
                  fill="#3E4095"
                />
              </svg>
            </div>
            <h4>Խորհրդատվություն</h4>
            <p>
              Անհրաժեշտ սարքավորման ճիշտ ընտրության համար առաջարկում ենք
              խորհրդակցել մեր մասնագետների հետ:
            </p>
            <a href="#">
              <span>Կարդալ ավելին</span>
              <span>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="24"
                  height="14"
                  viewBox="0 0 24 14"
                  fill="none"
                >
                  <path
                    d="M0 7.00002C0 7.26523 0.105357 7.51959 0.292893 7.70712C0.48043 7.89466 0.734784 8.00002 1 8.00002H20.586L16.294 12.292C16.1118 12.4806 16.011 12.7332 16.0133 12.9954C16.0156 13.2576 16.1208 13.5084 16.3062 13.6938C16.4916 13.8792 16.7424 13.9844 17.0046 13.9867C17.2668 13.989 17.5194 13.8882 17.708 13.706L23.708 7.70602C23.8005 7.61402 23.874 7.50464 23.9241 7.38417C23.9742 7.26369 24 7.1345 24 7.00402V7.00002C24 6.87002 23.974 6.74002 23.922 6.61802C23.8722 6.49678 23.7987 6.38665 23.706 6.29402L17.706 0.294017C17.5174 0.111859 17.2648 0.011065 17.0026 0.0133435C16.7404 0.0156219 16.4896 0.120791 16.3042 0.306199C16.1188 0.491607 16.0136 0.74242 16.0113 1.00462C16.009 1.26681 16.1098 1.51942 16.292 1.70802L20.586 6.00002H1C0.734784 6.00002 0.48043 6.10537 0.292893 6.29291C0.105357 6.48045 0 6.7348 0 7.00002Z"
                    fill="#3E4095"
                  />
                </svg>
              </span>
            </a>
          </div>
          <div className={styles.serviceCard}>
            <div className={styles.icon}>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="26"
                height="26"
                viewBox="0 0 26 26"
                fill="none"
              >
                <path
                  d="M18.332 1.77203H0V19.607L4.124 15.483H18.332V1.77203ZM4.57031 4.81891H13.7617V6.34235H4.57031V4.81891ZM13.7617 12.4361H4.57031V10.9127H13.7617V12.4361ZM15.2852 9.38922H3.04688V7.86578H15.2852V9.38922Z"
                  fill="#3E4095"
                />
                <path
                  d="M19.8555 17.0064H7.61719V20.0533H21.8252L26 24.228V6.34235H19.8555V17.0064Z"
                  fill="#3E4095"
                />
              </svg>
            </div>
            <h4>Խորհրդատվություն</h4>
            <p>
              Անհրաժեշտ սարքավորման ճիշտ ընտրության համար առաջարկում ենք
              խորհրդակցել մեր մասնագետների հետ:
            </p>
            <a href="#">
              <span>Կարդալ ավելին</span>
              <span>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="24"
                  height="14"
                  viewBox="0 0 24 14"
                  fill="none"
                >
                  <path
                    d="M0 7.00002C0 7.26523 0.105357 7.51959 0.292893 7.70712C0.48043 7.89466 0.734784 8.00002 1 8.00002H20.586L16.294 12.292C16.1118 12.4806 16.011 12.7332 16.0133 12.9954C16.0156 13.2576 16.1208 13.5084 16.3062 13.6938C16.4916 13.8792 16.7424 13.9844 17.0046 13.9867C17.2668 13.989 17.5194 13.8882 17.708 13.706L23.708 7.70602C23.8005 7.61402 23.874 7.50464 23.9241 7.38417C23.9742 7.26369 24 7.1345 24 7.00402V7.00002C24 6.87002 23.974 6.74002 23.922 6.61802C23.8722 6.49678 23.7987 6.38665 23.706 6.29402L17.706 0.294017C17.5174 0.111859 17.2648 0.011065 17.0026 0.0133435C16.7404 0.0156219 16.4896 0.120791 16.3042 0.306199C16.1188 0.491607 16.0136 0.74242 16.0113 1.00462C16.009 1.26681 16.1098 1.51942 16.292 1.70802L20.586 6.00002H1C0.734784 6.00002 0.48043 6.10537 0.292893 6.29291C0.105357 6.48045 0 6.7348 0 7.00002Z"
                    fill="#3E4095"
                  />
                </svg>
              </span>
            </a>
          </div>
        </Carousel>
      </div>
    </div>
  );
};

export default ServiceSection;
